loginapi/app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def index
        current_user = User.find_by_id(session[:current_user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        v = User.find(params[:id])

INSERT INTO "users" ("name", "email", "address", "password_digest", "phone_number", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        v = !params[:name].empty? and !params[:email].empty? and params[:address].empty? and !params[:password].empty? and !params[:phone_number].empty? and !params[:role_id].nil?
        if (v)
              p=User.create(
              'name': params[:name],
              'email': params[:email],
              'address': params[:address],
              'password': params[:password],
              'phone_number': params[:phone_number],
              'role_id': params[:role_id])